/*******************************************************************************
File name   : app_math.h
Author      : Yu You Cheng
Version     : V1.0
Date        : 2026-02-05
Description : 请详细说明此程序文件完成的主要功能 
History     : 修改记录，每条记录应包括修改日期、修改者及修改内容简述
              1. Date: 
                  Author: 
                  Modification: 

*******************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __APP_MATH_H__
#define __APP_MATH_H__

#ifdef __cplusplus
  extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/

#if USE_APP_MATH

/* Exported define -----------------------------------------------------------*/

/* Exported macro ------------------------------------------------------------*/

/* Exported typedef ----------------------------------------------------------*/

/* Private moudle variables --------------------------------------------------*/

/* Private moudle functions --------------------------------------------------*/

/* Private moudle end_flag ---------------------------------------------------*/

/* Exported variables --------------------------------------------------------*/

/* Exported functions --------------------------------------------------------*/
float app_fast_sqrtf(float x);
/* ---------------------------------------------------------------------------*/
#else
app_inline float app_fast_sqrtf(float x) {return 0.0f;}
#endif
/* ---------------------------------------------------------------------------*/

#ifdef __cplusplus
}
#endif

#endif /* __APP_MATH_H__ */

/************************ END OF FILE *****************************************/
